In [1]:
import pandas as pd

In [14]:
a = [1, 3, 5, 6]
b = [4, 5, 4 ,6]
c = [5, 3, 5, 3]

In [15]:
df = pd.DataFrame([a, b, c], ['r1', 'r2', 'r3'], ['c1', 'c2', 'c3', 'c4'])
df

    c1  c2  c3  c4
r1   1   3   5   6
r2   4   5   4   6
r3   5   3   5   3

In [6]:
df['c5'] = df['c1'] ** 2
df

    c1  c2  c3  c4  c5
r1   1   3   5   6   1
r2   4   5   4   6  16
r3   5   3   5   3  25

In [13]:
df1 = df.drop(columns=['c3'])
df1

    c1  c2  c4  c5
r1   1   3   6   1
r3   5   3   3  25

In [16]:
df

    c1  c2  c3  c4
r1   1   3   5   6
r2   4   5   4   6
r3   5   3   5   3

In [17]:
df.loc['r1']

c1    1
c2    3
c3    5
c4    6
Name: r1, dtype: int64

In [19]:
df.iloc[2]

c1    5
c2    3
c3    5
c4    3
Name: r3, dtype: int64

In [22]:
df.loc['r2', 'c3']

4

In [23]:
df.iloc[1, 2]

4

In [25]:
df

    c1  c2  c3  c4
r1   1   3   5   6
r2   4   5   4   6
r3   5   3   5   3

In [24]:
df % 2 == 0

       c1     c2     c3     c4
r1  False  False  False   True
r2   True  False   True   True
r3  False  False  False  False

In [26]:
df[df % 2 == 0]

     c1  c2   c3   c4
r1  NaN NaN  NaN  6.0
r2  4.0 NaN  4.0  6.0
r3  NaN NaN  NaN  NaN

In [31]:
df[df['c4'] % 2 == 0][['c1', 'c3']]

    c1  c3
r1   1   5
r2   4   4

In [32]:
import numpy as np

In [47]:
my_dict = {'a': [1, 2, 3, 4], 'b': [3, np.nan, 4, 6], 'c': [4, np.nan, 5, 3], 'd': [6, np.nan, np.nan, np.nan]}
d = pd.DataFrame(my_dict)
d

   a    b    c    d
0  1  3.0  4.0  6.0
1  2  NaN  NaN  NaN
2  3  4.0  5.0  NaN
3  4  6.0  3.0  NaN

In [39]:
d.dropna(axis=1)

   a
0  1
1  2
2  3
3  4

In [44]:
d.dropna(thresh=4)

   a    b    c    d
0  1  3.0  4.0  6.0

In [46]:
d.fillna(100)

   a      b      c      d
0  1    3.0    4.0    6.0
1  2  100.0  100.0  100.0
2  3    4.0    5.0  100.0
3  4    6.0    3.0  100.0

In [49]:
d['b'].fillna(value= d['b'].mean())

0    3.000000
1    4.333333
2    4.000000
3    6.000000
Name: b, dtype: float64

In [55]:
p = {'item' : ['apple', 'apple', 'orange', 'orange', 'guns', 'guns', 'apple'],
      'day' : ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'],
      'sale' : [100, 80, 200, 100, 5, 10, 20]}

In [56]:
data = pd.DataFrame(p)
data

     item  day  sale
0   apple  mon   100
1   apple  tue    80
2  orange  wed   200
3  orange  thu   100
4    guns  fri     5
5    guns  sat    10
6   apple  sun    20

In [60]:
x = data.groupby('item').describe().transpose()
x

item             apple       guns      orange
sale count    3.000000   2.000000    2.000000
     mean    66.666667   7.500000  150.000000
     std     41.633320   3.535534   70.710678
     min     20.000000   5.000000  100.000000
     25%     50.000000   6.250000  125.000000
     50%     80.000000   7.500000  150.000000
     75%     90.000000   8.750000  175.000000
     max    100.000000  10.000000  200.000000

In [61]:
x1 = {'a': [1, 2, 3], 'b': [4, 5, 6]}
x2 = {'c': [3, 4, 5], 'd': [6, 3, 7]}

In [62]:
x = pd.DataFrame(x1, index= ['p1', 'p2', 'p3'])
y = pd.DataFrame(x2, index= ['p1', 'p2', 'p3'])

In [66]:
x.join(y, how='left')

    a  b  c  d
p1  1  4  3  6
p2  2  5  4  3
p3  3  6  5  7

In [67]:
x1 = {'a': [1, 1, 1, 1], 'b': [1, 1, 1 ,1], 'c': [1, 1, 1, 1], 'd': [1, 1, 1 ,1], 'e': [1, 1, 1, 1]}
x2 = {'e': [2, 2, 2, 2], 'f': [2, 2, 2, 2], 'g': [2, 2, 2, 2], 'h': [2, 2, 2, 2], 'i': [2, 2, 2, 2]}
x3 = {'a': [3, 3, 3, 3], 'b': [3, 3, 3, 3], 'c': [3, 3, 3, 3], 'd': [3, 3, 3, 3], 'e': [3, 3, 3, 3]}

In [70]:
d1 = pd.DataFrame(x1, index=[1, 2, 3, 4])
d2 = pd.DataFrame(x2, index=[1, 2, 3, 4])
d3 = pd.DataFrame(x3, index=[1, 2, 3, 4])

In [74]:
pd.concat([d1, d2], axis=1)

   a  b  c  d  e  e  f  g  h  i
1  1  1  1  1  1  2  2  2  2  2
2  1  1  1  1  1  2  2  2  2  2
3  1  1  1  1  1  2  2  2  2  2
4  1  1  1  1  1  2  2  2  2  2

In [75]:
pd.concat([d1, d3], axis=0)

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
1  3  3  3  3  3
2  3  3  3  3  3
3  3  3  3  3  3
4  3  3  3  3  3